{
  "name": "KARTHIK BIBIREDDY",
  "headline": "Quantitative Engineer | Distributed Systems & Data-Driven Strategy",
  "professionalSummary": "Quantitative engineer with 8+ years of experience building distributed systems, high-performance APIs, and large-scale data pipelines. Strong foundation in probability, statistics, and algorithmic optimization, with applied expertise in financial data modeling, backtesting strategies, and real-time systems. Experienced in C++/Python for low-latency systems, cloud-scale data engineering (AWS, Spark, DynamoDB), and quantitative analysis. Passionate about solving complex stochastic problems, extracting alpha from noisy datasets, and bridging large-scale systems design with quantitative finance applications.",
  "contact": {
    "email": "karthikbibireddy@hotmail.com",
    "phone": "+1 (832) 812-3919",
    "location": "Seattle, WA",
    "linkedin": "https://linkedin.com/in/kbibireddy",
    "github": "https://github.com/kbibireddy"
  },
  "workExperience": [
    {
      "title": "Software Development Engineer II",
      "company": "Amazon",
      "period": "Jul 2020 – Present",
      "description": [
        "Engineered distributed pricing computation pipelines, processing signals from millions of data points daily and improving pricing accuracy across 400K+ products.",
        "Designed and optimized large-scale real-time systems for reference price computation, reducing latency and improving throughput under high transaction volume.",
        "Integrated external market-like signals into decision frameworks by formalizing SLAs and onboarding higher-quality feeds, boosting internal signal adoption by 320bps.",
        "Led design and rollout of debugging/analysis tooling for pricing signals, enabling faster model evaluation and reducing operational support effort by 25%.",
        "Mentored engineers on statistical reasoning in pipeline design, ensuring robust handling of noise, outliers, and biased data inputs."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Algoface",
      "period": "Mar 2019 – Jun 2020",
      "description": [
        "Optimized execution of computer vision models with WebAssembly, applying numerical optimization to achieve consistent low-latency performance across heterogeneous devices.",
        "Worked with research teams to analyze statistical models, propose accuracy/performance trade-offs, and deliver measurable improvements to predictive performance.",
        "Owned data engineering and infrastructure pipelines to support real-time inference, ensuring reproducibility and reliability of model-driven outputs."
      ]
    },
    {
      "title": "Software Engineer",
      "company": "Windhover Labs",
      "period": "Sep 2017 – Feb 2019",
      "description": [
        "Built real-time avionics systems (geolocation, ADS-B aircraft tracking, Primary Flight Displays) requiring high precision, deterministic performance, and reliability under uncertainty.",
        "Developed APIs and data tooling to process telemetry data at scale, ensuring efficient statistical handling of high-frequency flight data.",
        "Designed modular ground station UIs and workflows for real-time multi-signal monitoring and analysis, improving operator decision-making."
      ]
    },
    {
      "title": "Software Developer Intern",
      "company": "Zdaly",
      "period": "Jun 2017 – Aug 2017",
      "description": [
        "Developed NLP-driven applications for energy and finance clients, applying topic modeling and keyword extraction to large text corpora.",
        "Engineered high-throughput data ingestion pipelines processing millions of global news sources daily, ensuring reliable and low-latency data delivery.",
        "Delivered financial analytics features to enterprise dashboards, enabling structured access to real-time market-moving information."
      ]
    }
  ],
  "projects": [
    {
      "title": "Technical Analysis Platform for Financial Markets",
      "status": "WIP",
      "description": [
        "Built a backtesting and strategy analysis platform leveraging historical market data, with event-driven AWS Lambda workflows and ETL pipelines for sentiment and technical indicators.",
        "Implemented a React-based dashboard for evaluating trading strategies, measuring performance, and comparing ROI across multiple approaches."
      ],
      "technologies": ["Python", "AWS Lambda", "S3", "React", "TypeScript"],
      "link": "https://github.com/kbibireddy/tapfm"
    },
    {
      "title": "Real Estate Investment Analysis Tool",
      "status": "Active",
      "description": [
        "Developed quantitative models to compare buy vs rent tradeoffs, incorporating interest rates, taxes, and ownership costs.",
        "Delivered an interactive tool to compute projected ROI, breakeven points, and long-term investment value, framing problems in a finance-driven decision-making context."
      ],
      "technologies": ["JavaScript", "React", "TypeScript"],
      "link": "https://kbibireddy.github.io/real-estate-investment-app/"
    }
  ],
  "education": [
    {
      "degree": "Master's Degree in Computer Science",
      "school": "University of Houston - Main Campus",
      "period": "AUG 2015 - MAY 2017",
      "gpa": "3.25",
      "focus": "Algorithms, Data Mining, Statistical Computing"
    },
    {
      "degree": "Bachelor's Degree in Computer Science",
      "school": "SRM University - Main Campus",
      "period": "AUG 2011 - MAY 2015",
      "gpa": "8.0",
      "focus": "Probability, Statistics, Optimization"
    }
  ],
  "skills": [
    { "name": "C++", "proficiency": 5, "category": "Languages" },
    { "name": "Python", "proficiency": 5, "category": "Languages" },
    { "name": "Java", "proficiency": 4, "category": "Languages" },
    { "name": "Scala", "proficiency": 4, "category": "Languages" },
    { "name": "Low-Latency Systems", "proficiency": 5, "category": "Systems" },
    { "name": "Distributed Systems", "proficiency": 5, "category": "Systems" },
    { "name": "Apache Spark", "proficiency": 4, "category": "Data" },
    { "name": "ETL Pipelines", "proficiency": 5, "category": "Data" },
    { "name": "Probability & Statistics", "proficiency": 5, "category": "Math" },
    { "name": "Time Series Analysis", "proficiency": 4, "category": "Math" },
    { "name": "Stochastic Processes", "proficiency": 4, "category": "Math" },
    { "name": "Optimization", "proficiency": 4, "category": "Math" },
    { "name": "Backtesting", "proficiency": 4, "category": "Finance" },
    { "name": "Algorithmic Trading", "proficiency": 3, "category": "Finance" },
    { "name": "Technical Analysis", "proficiency": 3, "category": "Finance" },
    { "name": "AWS", "proficiency": 5, "category": "Cloud" },
    { "name": "Docker", "proficiency": 4, "category": "Tools" },
    { "name": "Git", "proficiency": 4, "category": "Tools" }
  ]
}
